"""
Розділ 3
Описати функцію Fact2 (N) дійсного типу, яка обчислює подвійний факторіал:
N!!=1·3·5·...·N,якщоN-непарне;
N!!=2·4·6·...·N,якщоN-парне
(N> 0 - параметр цілого типу; дійсне значення повертається функцією для того, щоб
уникнути цілочисельного переповнення при великих значеннях N). За допомогою
цієї функції знайти подвійні факторіали п'яти даних цілих чисел.
Скорий Євген 141
"""

def Fact2(a):
    s = 1
    if a % 2 == 0:
        for i in range(2, a + 1, 2):
            s *= i
        return s
    elif a == 0:
        return 1
    else:
        for i in range(1, a + 1, 2):
            s *= i
        return s

for i in range(5):
    n = int(input("Введіть число ціле число = "))
    if n < 0:
        print("Помилка: число повинне бути позитивне")
    else:
        print("Подвійний факторіал дорівнює ", Fact2(n))
