"""
Розділ 1
8. Описати функцію AddRightDigit (D, K), що додає до цілого позитивного числа K
праворуч цифру D (D - вхідний параметр цілого типу, що лежить в діапазоні 0-9, K -
параметр цілого типу, який є одночасно вхідним і вихідним). За допомогою цієї
функції послідовно додати до цього числа K праворуч дані цифри D1 і D2, виводячи
результат кожного додавання.
Скорий Євген 141
"""

def AddRightDigit (D, K):
    K = K * 10 + D
    return K

K = int(input("Введіть число K = "))
D1 = int(input("Введіть число D1 від 0-9 = "))

print("Нове число")
k = AddRightDigit (D1, K)
print(AddRightDigit (D1, K))
D2 = int(input("Введіть число D2 від 0-9 = "))

print("Нове число")
print(AddRightDigit (D2, k))
